cases/openfoam.com/magnusEffect/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:                                        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pisoFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         40;

deltaT          0.002;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    scalar
    {
        type                scalarTransport; 
        libs                (solverFunctionObjects);

        resteOnStartup      no;
        enabled             true;
        field               S;
        
        fvOptions
        {
            sources
            {
                type        scalarSemiImplicitSource;
                enabled     true;

                scalarSemiImplicitSourceCoeffs
                {
                    selectionMode points;
                    volumeMode    absolute;
                    points
                    (
                        (-0.25 0.08 0.11)
                        (-0.25 0.14 0.11)
                        (-0.25 0.15 0.11)
                        (-0.25 0.22 0.11)
                    );

                    injectionRateSuSp
                    {
                        S       (1 0);
                    }
                }
            }
        }
    }
};


// ************************************************************************* //
